Учебные проекты2/Виртуальные таблицы регистров/Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Documents/УстановкаЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)

	ДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьФормы()
		Если Объект.Согласовано = Истина Тогда
		Элементы.Дата.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Согласовано.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.ГруппаТовары.Доступность = Ложь;
	Иначе
		Элементы.Номер.Доступность = Истина;
		Элементы.Дата.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Согласовано.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.ГруппаТовары.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьФормы();
	КонецПроцедуры
